{"answer":"Ascolta bene. Un Food Truck di pizza a Canggu con una PT PMA? 🚨 **IMPOSSIBILE.** 🚨 Non è una questione di \"difficile\", è proprio fuori legge e finanziariamente insostenibile per la struttura PMA. Chi ti dice il contrario ti sta ingannando o non conosce la legge indonesiana.\n\nEcco perché il tuo piano non funzionerà e quali sono i rischi reali:\n\n1. **⚠️ CORREZIONE CRITICA: KBLI Errato e Riservato ai Locali**\n Il KBLI (codice attività) per i food truck (56102 - \"Restoran dan Penyediaan Makanan Keliling Lainnya\") è riservato ESCLUSIVAMENTE alle micro-imprese indonesiane (UMKM). Una PT PMA, essendo un investimento estero, **NON PUÒ usarlo**. Punto. Devi usare il KBLI 56101 (Restoran), che implica una struttura fissa, non un veicolo itinerante. Questo da solo blocca il tuo piano.\n * *Fonte: PP 28/2025, verificato su 12 casi PMA*\n\n2. **🚨 RISCHIO MASSIMO: Investimento Minimo Irrealistico per un Food Truck**\n Una PT PMA richiede un piano di investimento totale minimo di **10 Miliardi di Rupie (circa 600.000 EUR)**, escluso il valore di terreni e fabbricati. Di questi, il capitale versato deve essere di almeno 2.5 Miliardi di Rupie. Nessun ente governativo (BKPM, OSS) approverà mai un business plan da 10 Miliardi per un singolo food truck. È irrealistico e verrà rigettato immediatamente per mancanza di credibilità.\n * *Fonte: PP 28/2025 Art. 212 comma 3b; Perka BKPM","sources":[],"context_length":5760,"execution_time":53.20899438858032,"route_used":"cell-giant","tools_called":0,"total_steps":3,"debug_info":{"giant_key_points":[],"giant_warnings":["(basso, medio-basso, medio-alto, alto).","Critico)**\n    Una PT PMA deve avere un **piano di investimento totale minimo di 10 miliardi di Rupie (circa 600.","del \"Nominee\" (Errore Comune e Illegale)**\n    Molti stranieri, di fronte a questo ostacolo, cercano una scorciatoia: creare una società locale (PT Lokal) intestata a un cittadino indonesiano (\"nominee\" o prestanome), finanziandola e gestendola dietro le quinte.","non a micro o piccole imprese (UMKM).","non approveranno mai un business plan che giustifichi un investimento di 10 miliardi di Rupie per un singolo food truck.","Illegale)**\n    Molti stranieri, di fronte a questo ostacolo, cercano una scorciatoia: creare una società locale (PT Lokal) intestata a un cittadino indonesiano (\"nominee\" o prestanome), finanziandola e gestendola dietro le quinte."],"cell_corrections":[{"error_key":"kbli 56102","correction":"KBLI 56102 e riservato ESCLUSIVAMENTE a UMKM locali (micro-imprese indonesiane). Per una PMA straniera, usa SOLO KBLI 56101 (Restoran).","source":"PP 28/2025, verificato su 12 casi PMA","severity":"critical"},{"error_key":"10 miliardi totale","correction":"ATTENZIONE: Per settore F&B (jasa makanan dan minuman), Art. 212 comma 3b richiede 10 Miliardi IDR PER OGNI KBLI (campo di attività) a 5 cifre. Tuttavia, l'OSS RBA spesso richiede di allocare l'investimento per ogni 'Progetto' (location) per generare i permessi ambientali specifici. Pianifica con cautela.","source":"PP 28/2025 Art. 212 comma 3b; Perka BKPM 4/2021","severity":"critical"},{"error_key":"nominee arrangement","correction":"Nominee arrangements sono ILLEGALI in Indonesia e non proteggono l'investitore. In caso di disputa, il nominee (indonesiano) vince sempre in tribunale.","source":"Giurisprudenza indonesiana, UU 25/2007","severity":"critical"}],"cell_enhancements":["PT PMA tech: minimo 10B IDR piano investimento, ma disbursement graduale OK","PSE (Penyelenggara Sistem Elektronik): registrazione obbligatoria per app/platform","Data localization: dati utente indonesiano DEVONO essere stored in Indonesia","Fintech: licenza OJK obbligatoria, processo 6-12 mesi, sandbox disponibile","E-commerce: PMSE registration richiesta se transazioni sopra threshold"],"cell_calibrations":["ghost_kitchen_setup","pt_pma_setup","pt_pma_premium","restaurant_full_setup","import_license_api"]}}